#pragma once
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* ファイル操作                                                              */
/*                                                                           */
/* ------------------------------------------------------------------------- */
/*  番号    更新内容                                更新日      名前         */
/* ------------------------------------------------------------------------- */
/* 000000   新規作成                                2020/01/24  西岡  和輝   */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* includeファイル                                                           */
/* ------------------------------------------------------------------------- */

#define  _CRT_NO_SECURE_WARNINGS
#define  _CRT_SECURE_NO_DEPRECATE
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* ------------------------------------------------------------------------- */
/* 定数定義	                                                                 */
/* ------------------------------------------------------------------------- */

#define SYSTEMCODE_FILED   (   0 )
#define SYSTEMCODE_SUCCSES (   1 )

/* ------------------------------------------------------------------------- */
/* typedef宣言                                                               */
/* ------------------------------------------------------------------------- */

typedef signed   int   SINT;
typedef unsigned int   UINT;
typedef signed   long  SLNG;
typedef unsigned long  ULNG;
typedef signed   short SSHT;
typedef unsigned short USHT;
typedef signed   char  SCHR;
typedef unsigned char  UCHR;

/* ------------------------------------------------------------------------- */
/* 構造体定義                                                                */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* グローバル変数                                                            */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* プロトタイプ宣言                                                          */
/* ------------------------------------------------------------------------- */

class FileUtils {

public:
    FileUtils();        /* コンストラクタ */
    ~FileUtils();       /* デストラクタ   */
    /* 変数 */
    
    /* 関数 */
    void  OpenReadMode  ( SCHR* );
    void  OpenWriteMode ( SCHR* );
    void  Close         ();
    void  Out           ( SCHR*, SCHR* , ULNG ); 
    ULNG  GetFileSize   ();
    SCHR* GetMemory     ();
    SCHR* SetMemory     ();
    void  FreeMemory    ();
    SCHR  CheckErr      ();
    SCHR* GetErrMsg     ();

private:
    /* 変数 */
    ULNG  ulfileSize;   /* ファイルサイズ                         */
    SCHR  scerrCode;    /* エラーコード                           */
    SCHR* scerrMessage; /* エラー内容                             */
    SCHR* scfileOnMem;  /* メモリに書き込まれたファイルのバイナリ */
    FILE* fp;           /* ファイルポインタ                       */

    /* 関数 */
    void  open        ( SCHR*, SCHR* );
    void  setFileSize ();
    void  setErr      ();
    void  setErrMsg   ( SCHR* );
    void  freeErrMsg  ();
};